krapyv/stm32-i2c-driver/i2c.c
        case I2C_RX:
            // N = 1: no BTF is possible (shift register never fills with nothing behind it)
            // N = 2 case
            if (hi2c.RxLength == 2)
            {
                // after BTF is read, we have the byte 1 in the DR, the byte 2 in the shift register

                // issue STOP
                hi2c.Instance->CR1 |= (1 << 9);

                // read both bytes (after the byte 1 is read, the byte 2 immediately drops from shift register to the DR)
                hi2c.pRxBuffPtr[0] = hi2c.Instance->DR; // byte 1
                hi2c.pRxBuffPtr[1] = hi2c.Instance->DR; // byte 2

                // after both bytes have been read, clear POS
                hi2c.Instance->CR1 &= ~(1 << 11);

                // after all bytes have been read, re-enable the ACK bit in CR1
                hi2c.Instance->CR1 |= (1 << 10);

                hi2c.state = I2C_STATE_FINISHING;
            }
            else if (hi2c.RxLength >= 3)
            {
                if (hi2c.index == hi2c.RxLength - 3)
                {
                    // if BTF is fired, byte N - 2 in DR, byte N - 1 in shift register

                    // clear ACK bit 10 in CR1
                    hi2c.Instance->CR1 &= ~(1 << 10);

                    // read data N-2
                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;
                    hi2c.index++;

                    break;
                }

                else if (hi2c.index == hi2c.RxLength - 2)
                {
                    // if BTF is fired, byte N - 1 in DR, byte N in shift register

                    // set STOP high (we have all the bytes we need)
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read bytes N - 1 and N
                    hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N

                    // after all bytes have been read, re-enable the ACK bit in CR1
                    hi2c.Instance->CR1 |= (1 << 10);

                    hi2c.state = I2C_STATE_FINISHING;
                }
            }
            break;

        case I2C_TX_RX:
            if (hi2c.phase == I2C_TX_RX_WRITE)
            {
                // repeated start
                hi2c.Instance->CR1 |= (1 << 8);
                // reset index
                hi2c.index = 0;

                // flip the phase value
                hi2c.phase = I2C_TX_RX_READ;
            }
            else if (hi2c.phase == I2C_TX_RX_READ)
            {
                // no BTF is possible (shift register never fills with nothing behind it)
                // N = 2 case
                if (hi2c.RxLength == 2)
                {
                    // after BTF is read, we have the byte 1 in the DR, the byte 2 in the shift register

                    // issue STOP
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read both bytes (after the byte 1 is read, the byte 2 immediately drops from shift register to the DR)
                    hi2c.pRxBuffPtr[0] = hi2c.Instance->DR; // byte 1
                    hi2c.pRxBuffPtr[1] = hi2c.Instance->DR; // byte 2

                    // after both bytes have been read, clear POS
                    hi2c.Instance->CR1 &= ~(1 << 11);

                    // after all bytes have been read, re-enable the ACK bit in CR1
                    hi2c.Instance->CR1 |= (1 << 10);

                    hi2c.state = I2C_STATE_FINISHING;
                }
                else if (hi2c.RxLength >= 3)
                {
                    if (hi2c.index == hi2c.RxLength - 3)
                    {
                        // if BTF is fired, byte N - 2 in DR, byte N - 1 in shift register

                        // clear ACK bit 10 in CR1
                        hi2c.Instance->CR1 &= ~(1 << 10);

                        // read data N-2
                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;
                        hi2c.index++;

                        break;
                    }

                    else if (hi2c.index == hi2c.RxLength - 2)
                    {
                        // if BTF is fired, byte N - 1 in DR, byte N in shift register

                        // set STOP high (we have all the bytes we need)
                        hi2c.Instance->CR1 |= (1 << 9);

                        // read bytes N - 1 and N
                        hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N

                        // after all bytes have been read, re-enable the ACK bit in CR1
                        hi2c.Instance->CR1 |= (1 << 10);

                        hi2c.state = I2C_STATE_FINISHING;
                    }
                }
            }

            break;
        }
    }
    // RxNE bit 6 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 6))
    {

        if (hi2c.RxLength == 1)
        {
            // stop is already set after the clearing of the ADDR

            // read the byte
            hi2c.pRxBuffPtr[0] = hi2c.Instance->DR;

            // enabled ACK
            hi2c.Instance->CR1 |= (1 << 10);

            // ITBUFEN is not disabled

            hi2c.state = I2C_STATE_FINISHING;
        }

        // RxLength == 2 does not use RxE

        // RxLength >= 3
        else if (hi2c.RxLength >= 3)
        {
            if (hi2c.index < hi2c.RxLength - 2)
            {
                hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR;

                if (hi2c.index == hi2c.RxLength - 3)
                {
                    // disable ITBUFEN, so the last two bytes are BTF-only
                    hi2c.Instance->CR2 &= ~(1 << 10);
                }
            }
        }
    }
    // TxE bit 7 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 7))
    {
        if (hi2c.index < hi2c.TxLength)
        {
            if (hi2c.index == hi2c.TxLength - 1)
            {
                // disable ITBUFEN
                hi2c.Instance->CR2 &= ~(1 << 10);
            }
            hi2c.Instance->DR = hi2c.pTxBuffPtr[hi2c.index++];
        }
    }

    return;
}

// Error Interrupts Handler (priority 39 - can be preempted by I2C1_EV)
void I2C1_ER_IRQHandler(void)
{
    // disable interrupts
    __disable_irq();

    // populate the error_code

    // make snapshot of current state of SR1
    uint16_t sr1_snap = hi2c.Instance->SR1;

    uint16_t sr1_errors_snap = (sr1_snap & ((uint16_t)0xF << 8));

    // isolate the errors bits 11:8 and assigning to the error_code
    // 0b00001111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
    hi2c.error_code = sr1_errors_snap;

