krapyv/stm32-i2c-driver/i2c.c
    // error code checking branches
    if (hi2c.error_code & I2C_ERROR_BERR)
    {
        // needs SWRST hard reset

        // since I immediately enable SWRST, there is no explicit SR1 error flag clearing
        // the SR1 flags cleared immediately by SWRST

        // set SWRST to 1
        hi2c.Instance->CR1 |= (1 << 15);

        // clear the pending EV interrupt
        // I2C1_EV has a position of 31
        // one ICPR has 32 Interrupt-related bits (0...31)

        // with NVIC the write-1-to-clear is the tool that allows to prevent race conditions if another interrupt fires mid-execution
        NVIC->ICPR[0] = (1 << 31);
    }
    else
    {
        if (hi2c.error_code & I2C_ERROR_ARLO)
        {
            // needs to wait until the current transmission is over because the another master seized the bus

            // clear the SR1 ARLO error flag
            // a single write to prevent late-incoming bits to SR1 from overwriting
            // bits 13 and 5 are reserved bits, write 0 to them
            hi2c.Instance->SR1 = ~((1 << 13) | (1 << 9) | (1 << 5));

            // no stop issuing since the microcontroller is no longer a master
        }
        if (hi2c.error_code & I2C_ERROR_AF)
        {
            // needs to issue STOP and then try the communication again

            // make snapshot of current CR1
            uint16_t cr1_snap = hi2c.Instance->CR1;
            uint32_t cr1_modified = cr1_snap;

            // clear the SR1 AF error flag
            // ~(1 << 10) = 11111011....
            hi2c.Instance->SR1 = ~((1 << 13) | (1 << 10) | (1 << 5));

            // check whether there was no ARLO error
            // if there is an ARLO error, that means that the microcontroler stopped being a master of the lines, it is now a target that just listens to the bus and waits when the controller that seized the bus concludes the communication.
            // AF recovery sequence however issues STOP. the MCU in target mode just releases the lines letting them float as a STOP sequence. so if there are both ARLO and AF errors simultaneously, the stop issuing in the AF Recovery sequence disappears
            if (!(sr1_errors_snap & I2C_ERROR_ARLO))
            {
                // issue STOP condition
                // set the STOP bit to 1
                cr1_modified |= (1 << 9);
            }

            // set the ACK bit to 1
            cr1_modified |= (1 << 10);
            // clear the POS bit
            cr1_modified &= ~(1 << 11);

            // direct write of the modified CR1 to I2C->CR1
            hi2c.Instance->CR1 = cr1_modified;
        }
    }

    // set the state to ERROR
    hi2c.state = I2C_STATE_ERROR;

    // enable interrupts
    __enable_irq();

    return;
}

static uint8_t I2C_Validate_Pins(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->channel == I2C_CHANNEL_1)
    {
        if (hi2c->scl_port == GPIOB && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 6 || hi2c->scl_pin == 8) && (hi2c->sda_pin == 7 || hi2c->sda_pin == 9))
            {
                return 1;
            }
        }
    }
    else if (hi2c->channel == I2C_CHANNEL_2)
    {
        if (hi2c->scl_port == GPIOB && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 10) && (hi2c->sda_pin == 3 || hi2c->sda_pin == 9))
            {
                return 1;
            }
        }
    }
    else if (hi2c->channel == I2C_CHANNEL_3)
    {
        if (hi2c->scl_port == GPIOA && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 8) && (hi2c->sda_pin == 4 || hi2c->sda_pin == 8))
            {
                return 1;
            }
        }
    }

    return 0;
}

// TODO: timeout mechanism via hi2c->get_tick_ms function pointer
// curretly spins indefinitely if hardware becomes unresponsive
// must be implemented before production use

void I2C_Init()
{
    if ((hi2c.channel >= I2C_CHANNEL_MAX) || !I2C_Validate_Pins(hi2c))
    {
        return;
    }

    /* ----- I2C Choosing ----- */
    if (hi2c.channel == 1)
    {
        hi2c->Instance = I2C1;
    }
    else if (hi2c.channel == 2)
    {
        hi2c.Instance = I2C2;
    }
    else
    {
        hi2c.Instance = I2C3;
    }
    /* ----- I2C Choosing ----- */

    switch (hi2c.channel)
    {
    case I2C_CHANNEL_1:
        // enable GPIOB clock
        RCC->AHB1ENR |= (1 << 1);

        // enable I2C for channel 1
        RCC->APB1ENR |= (1 << 21);

        break;
    case I2C_CHANNEL_2:
        // enable GPIOB clock
        RCC->AHB1ENR |= (1 << 1);

        // enable I2C for channel 2
        RCC->APB1ENR |= (1 << 22);

        break;
    case I2C_CHANNEL_3:
        // enable GPIOA and GPIOB clocks
        RCC->AHB1ENR |= (1 << 1) | (1 << 0);

        // enable I2C for channel 3
        RCC->APB1ENR |= (1 << 23);

        break;
    default:
        return;
    }

    /* ----- set the MODER for SCL pin and SDA pin to Alternate function ----- */
    // value: 10

    // one pin takes 2 bits, so (2 * pin_number):
    // e.g. pin 6 takes 2*6 = 12 => 13:12
    // pin 7 takes 2*7 = 14 => 15:14
    // pin 0 takes 2*0 = 0 => 1:0

    // clear the MODER bits
    // 11 = 0x3
    hi2c.scl_port->MODER &= ~(0x3 << (2 * hi2c.scl_pin));
    hi2c.sda_port->MODER &= ~(0x3 << (2 * hi2c.sda_pin));

    // set the MODER bits
    // 10 = 0x2
    hi2c.scl_port->MODER |= (0x2 << (2 * hi2c.scl_pin));
    hi2c.sda_port->MODER |= (0x2 << (2 * hi2c.sda_pin));

    /* ----- set the AFRL for SCL pin and SDA pin to AF4 ----- */
    // AF4 value: 0100

    // AFRL/AFRH uses 4 bits per 1 pin

    if (hi2c.scl_pin >= 8)
    {
        // pins 8-15 are set in AFRH

        // clear the AFRH bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c.scl_port->AFRH &= ~(0xF << (4 * (hi2c.scl_pin - 8))); // scl_pin - 8 to prevent overflow of 32 bit register

        // set the bits to AF4
        hi2c.scl_port->AFRH |= (GPIO_AF4 << (4 * (hi2c.scl_pin - 8)));
    }
    else
    {
        // pins 0-7 are set in AFRL

        // clear the AFRL bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c.scl_port->AFRL &= ~(0xF << (4 * hi2c.scl_pin));

        // set the bits to AF4
        hi2c.scl_port->AFRL |= (GPIO_AF4 << (4 * hi2c.scl_pin));
    }

    if (hi2c.sda_pin >= 8)
    {
        // pins 8-15 are set in AFRH

