krapyv/stm32-i2c-driver/i2c.c
        // clear the AFRH bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c.sda_port->AFRH &= ~(0xF << (4 * (hi2c.sda_pin - 8))); // sda_pin - 8 to prevent overflow of 32 bit register

        // set the bits to AF4
        hi2c.sda_port->AFRH |= (GPIO_AF4 << (4 * (hi2c.sda_pin - 8)));
    }
    else
    {
        // pins 0-7 are set in AFRL

        // clear the AFRL bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c.sda_port->AFRL &= ~(0xF << (4 * hi2c.sda_pin));

        // set the bits to AF4
        hi2c.sda_port->AFRL |= (GPIO_AF4 << (4 * hi2c.sda_pin));
    }

    /* ----- set the OTYPER for SCL pin and SDA pin to Open-drain ----- */
    // value 1

    hi2c.scl_port->OTYPER |= (1 << hi2c.scl_pin);
    hi2c.sda_port->OTYPER |= (1 << hi2c.sda_pin);

    /* ----- explicitly clear the PUPDR for SCL and SDA pins ----- */
    // since PUPDR give 2 bits per pin, we are using (2 * SCL pin number), (2 * SDA pin number)

    // 11 = 0x3
    hi2c.scl_port->PUPDR &= ~(0x3 << (2 * hi2c.scl_pin));
    hi2c.sda_port->PUPDR &= ~(0x3 << (2 * hi2c.sda_pin));

    /* ----- I2C CCR configuration ----- */

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c.Instance;

    // explicitly disable PE (bit 0 CR1) to prevet undefined hardware behavior
    // if the PE is already 1 after reboot or SWRST recovery
    I2C->CR1 &= ~(1 << 0);

    // set the bit 15 to 0 (Sm mode I2C)
    I2C->CCR &= ~(1 << 15);

    // set the CCR [11:0] to 80 = 0x50, since CCR = T_high / T_pclk1
    // where T_high = 5000 ns, T_pclk1 = 62.5 ns (1 / 16 000 000)

    // clear the range 11:0
    // 111111111111 = 0xFF
    I2C->CCR &= ~(0xFFF << 0);

    // set the range to 0x50
    I2C->CCR |= (0x50 << 0);

    // set FREQ[5:0] (Peripheral clock frequency) in CR2
    // clear the bits
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 48 + 15 = 63 = 0x3F
    I2C->CR2 &= ~(0x3F << 0);

    // set the bits
    // 16 MHz = 010000 = 0x10
    I2C->CR2 |= (0x10 << 0);

    /* ----- TRISE configuration ----- */
    // set the bits 5:0 to 17 = 0x11
    // 1000 ns / 62.5 + 1 = 16 + 1 = 17

    // clear the range
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 40 + 20 + 3 = 63 = 0x3F
    I2C->TRISE &= ~(0x3F << 0);

    // set the range to 0x11
    I2C->TRISE |= (0x11 << 0);

    // ----- CR1 configuration ----- //

    // set bit 0 PE (Peripheral enabled) to 1

    I2C->CR1 |= (1 << 0);

    // set bit 10 ACK (Acknowledge enable) to 1
    // since this bit is set and cleared by software and cleared by hardware when PE = 0
    // it is enabled after PE became 1
    I2C->CR1 |= (1 << 10);

    /* ----- Interrupts enablement (NVIC) ----- */

    // I2C_EV has position 31 in the vector table
    // ISER[0] pos 31
    NVIC->ISER[0] = (1 << 31);

    // I2C_ER has position 32 in the vector table
    // ISER[1] pos 1
    NVIC->ISER[1] = (1 << 0);

    /* ----- Interrupts enablement (CR2) -----*/

    // set ITERREN (Error interrupt enable) Bit 8 to 1
    I2C->CR2 |= (1 << 8);

    // set ITEVTEN (Event interrupt enable) Bit 9 to 1
    I2C->CR2 |= (1 << 9);

    // the ITBUFEN will be enabled dynamically when we are actively ready to transmit or receive bytes
}

static uint8_t I2C_PollHardwareFlags(I2C_RegDef_t *I2C, I2C_Bit_Masks_t bit_mask)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8)))
        {
            uint32_t cr1_snap = I2C->CR1;

            sr1_snap &= ~((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8));

            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 = sr1_snap;

            uint32_t cr1_modified = cr1_snap;

            // set the STOP bit to 1
            cr1_modified |= (1 << 9);
            // set the ACK bit to 1
            cr1_modified |= (1 << 10);
            // clear the POS bit
            cr1_modified &= ~(1 << 11);

            // direct write of the modified CR1 to I2C->CR1
            I2C->CR1 = cr1_modified;

            return 1;
        }

        // secondly, check the bit
        if (sr1_snap & bit_mask)
        {
            // if the bit is set, exit the loop
            return 0;
        }
    }
}

uint8_t I2C_PollHardwareBusy(I2C_RegDef_t *I2C)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;
        uint32_t sr2_snap = I2C->SR2;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 10) | (1 << 9) | (1 << 8)))
        {
            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 &= ~((1 << 10) | (1 << 9) | (1 << 8));

            // generate STOP condition to gracefuly and safely release the lines
            I2C->CR1 |= (1 << 9);

            return 1;
        }

        if (!(sr2_snap & (1 << 1)))
        {
            // if the BUSY bit is 0, exit the loop
            return 0;
        }
    }
}

I2C_Status_t I2C_Master_Transmit(uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c.Instance == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    hi2c.slave_add = slave_addr;
    hi2c.pTxBuffPtr = data;
    hi2c.TxLength = length;
    hi2c.mode = I2C_TX;
    hi2c.index = 0;
    hi2c.error_code = 0;
    hi2c.state = I2C_STATE_TX_ADDR;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(hi2c.Instance))
    {
        return I2C_ERROR;
    }

    // start the transaction by issuing START (set to 1)
    hi2c.Instance->CR1 |= (1 << 8);
    // START is cleared by hardware when start is sent

    return I2C_OK;
}

I2C_Status_t I2C_Master_Receive(uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c.Instance == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    hi2c.slave_add = slave_addr;
    hi2c.pRxBuffPtr = data;
    hi2c.RxLength = length;
    hi2c.mode = I2C_RX;
    hi2c.index = 0;
    hi2c.error_code = 0;
    hi2c.state = I2C_STATE_RX_ADDR;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(hi2c.Instance))
    {
        return I2C_ERROR;
    }

    // Master issues the Start
    hi2c.Instance->CR1 |= (1 << 8);
    // hardware clears it after the start is sent

    return I2C_OK;
}

